<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"c31239058c755648aeb29fe103b12462ecb09626fbfebe1c0cbc3d10325befcd","plan_job_ref":"Job CI #2 at https://github.com/jacobscunn07/terraform-workflows-poc/actions/runs/5589715318","plan_hash":"0ed70561ef574a677354424029a8455e1f26c13627337149d7d01dbbf8578de4","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __.__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.foo will be created
  + resource "local_file" "foo" {
      + content              = "default foo!!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./foo.bar"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [CI #2](https://github.com/jacobscunn07/terraform-workflows-poc/actions/runs/5589715318)